MikroElektronika/core_packages/PIC/XC8/def/PIC18F6490/mcu.h
// Register: LCDDATA4
#define LCDDATA4 LCDDATA4
extern volatile unsigned char           LCDDATA4            __at(0xF64);
#ifndef _LIB_BUILD
asm("LCDDATA4 equ 0F64h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LCDDATA4               :8;
    };
    struct {
        unsigned S32C0                  :1;
        unsigned S33C0                  :1;
        unsigned S34C0                  :1;
        unsigned S35C0                  :1;
        unsigned S36C0                  :1;
        unsigned S37C0                  :1;
        unsigned S38C0                  :1;
        unsigned S39C0                  :1;
    };
    struct {
        unsigned SEG32COM0              :1;
        unsigned SEG33COM0              :1;
        unsigned SEG34COM0              :1;
        unsigned SEG35COM0              :1;
        unsigned SEG36COM0              :1;
        unsigned SEG37COM0              :1;
        unsigned SEG38COM0              :1;
        unsigned SEG39COM0              :1;
    };
} LCDDATA4bits_t;
extern volatile LCDDATA4bits_t LCDDATA4bits __at(0xF64);
// bitfield macros
#define _LCDDATA4_LCDDATA4_POSN                             0x0
#define _LCDDATA4_LCDDATA4_POSITION                         0x0
#define _LCDDATA4_LCDDATA4_SIZE                             0x8
#define _LCDDATA4_LCDDATA4_LENGTH                           0x8
#define _LCDDATA4_LCDDATA4_MASK                             0xFF
#define _LCDDATA4_S32C0_POSN                                0x0
#define _LCDDATA4_S32C0_POSITION                            0x0
#define _LCDDATA4_S32C0_SIZE                                0x1
#define _LCDDATA4_S32C0_LENGTH                              0x1
#define _LCDDATA4_S32C0_MASK                                0x1
#define _LCDDATA4_S33C0_POSN                                0x1
#define _LCDDATA4_S33C0_POSITION                            0x1
#define _LCDDATA4_S33C0_SIZE                                0x1
#define _LCDDATA4_S33C0_LENGTH                              0x1
#define _LCDDATA4_S33C0_MASK                                0x2
#define _LCDDATA4_S34C0_POSN                                0x2
#define _LCDDATA4_S34C0_POSITION                            0x2
#define _LCDDATA4_S34C0_SIZE                                0x1
#define _LCDDATA4_S34C0_LENGTH                              0x1
#define _LCDDATA4_S34C0_MASK                                0x4
#define _LCDDATA4_S35C0_POSN                                0x3
#define _LCDDATA4_S35C0_POSITION                            0x3
#define _LCDDATA4_S35C0_SIZE                                0x1
#define _LCDDATA4_S35C0_LENGTH                              0x1
#define _LCDDATA4_S35C0_MASK                                0x8
#define _LCDDATA4_S36C0_POSN                                0x4
#define _LCDDATA4_S36C0_POSITION                            0x4
#define _LCDDATA4_S36C0_SIZE                                0x1
#define _LCDDATA4_S36C0_LENGTH                              0x1
#define _LCDDATA4_S36C0_MASK                                0x10
#define _LCDDATA4_S37C0_POSN                                0x5
#define _LCDDATA4_S37C0_POSITION                            0x5
#define _LCDDATA4_S37C0_SIZE                                0x1
#define _LCDDATA4_S37C0_LENGTH                              0x1
#define _LCDDATA4_S37C0_MASK                                0x20
#define _LCDDATA4_S38C0_POSN                                0x6
#define _LCDDATA4_S38C0_POSITION                            0x6
#define _LCDDATA4_S38C0_SIZE                                0x1
#define _LCDDATA4_S38C0_LENGTH                              0x1
#define _LCDDATA4_S38C0_MASK                                0x40
#define _LCDDATA4_S39C0_POSN                                0x7
#define _LCDDATA4_S39C0_POSITION                            0x7
#define _LCDDATA4_S39C0_SIZE                                0x1
#define _LCDDATA4_S39C0_LENGTH                              0x1
#define _LCDDATA4_S39C0_MASK                                0x80
#define _LCDDATA4_SEG32COM0_POSN                            0x0
#define _LCDDATA4_SEG32COM0_POSITION                        0x0
#define _LCDDATA4_SEG32COM0_SIZE                            0x1
#define _LCDDATA4_SEG32COM0_LENGTH                          0x1
#define _LCDDATA4_SEG32COM0_MASK                            0x1
#define _LCDDATA4_SEG33COM0_POSN                            0x1
#define _LCDDATA4_SEG33COM0_POSITION                        0x1
#define _LCDDATA4_SEG33COM0_SIZE                            0x1
#define _LCDDATA4_SEG33COM0_LENGTH                          0x1
#define _LCDDATA4_SEG33COM0_MASK                            0x2
#define _LCDDATA4_SEG34COM0_POSN                            0x2
#define _LCDDATA4_SEG34COM0_POSITION                        0x2
#define _LCDDATA4_SEG34COM0_SIZE                            0x1
#define _LCDDATA4_SEG34COM0_LENGTH                          0x1
#define _LCDDATA4_SEG34COM0_MASK                            0x4
#define _LCDDATA4_SEG35COM0_POSN                            0x3
#define _LCDDATA4_SEG35COM0_POSITION                        0x3
#define _LCDDATA4_SEG35COM0_SIZE                            0x1
#define _LCDDATA4_SEG35COM0_LENGTH                          0x1
#define _LCDDATA4_SEG35COM0_MASK                            0x8
#define _LCDDATA4_SEG36COM0_POSN                            0x4
#define _LCDDATA4_SEG36COM0_POSITION                        0x4
#define _LCDDATA4_SEG36COM0_SIZE                            0x1
#define _LCDDATA4_SEG36COM0_LENGTH                          0x1
#define _LCDDATA4_SEG36COM0_MASK                            0x10
#define _LCDDATA4_SEG37COM0_POSN                            0x5
#define _LCDDATA4_SEG37COM0_POSITION                        0x5
#define _LCDDATA4_SEG37COM0_SIZE                            0x1
#define _LCDDATA4_SEG37COM0_LENGTH                          0x1
#define _LCDDATA4_SEG37COM0_MASK                            0x20
#define _LCDDATA4_SEG38COM0_POSN                            0x6
#define _LCDDATA4_SEG38COM0_POSITION                        0x6
#define _LCDDATA4_SEG38COM0_SIZE                            0x1
#define _LCDDATA4_SEG38COM0_LENGTH                          0x1
#define _LCDDATA4_SEG38COM0_MASK                            0x40
#define _LCDDATA4_SEG39COM0_POSN                            0x7
#define _LCDDATA4_SEG39COM0_POSITION                        0x7
#define _LCDDATA4_SEG39COM0_SIZE                            0x1
#define _LCDDATA4_SEG39COM0_LENGTH                          0x1
#define _LCDDATA4_SEG39COM0_MASK                            0x80

// Register: LCDDATA5
#define LCDDATA5 LCDDATA5
extern volatile unsigned char           LCDDATA5            __at(0xF65);
#ifndef _LIB_BUILD
asm("LCDDATA5 equ 0F65h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LCDDATA5               :8;
    };
    struct {
        unsigned S40C0                  :1;
        unsigned S41C0                  :1;
        unsigned S42C0                  :1;
        unsigned S43C0                  :1;
        unsigned S44C0                  :1;
        unsigned S45C0                  :1;
        unsigned S46C0                  :1;
        unsigned S47C0                  :1;
    };
    struct {
        unsigned SEG40COM0              :1;
        unsigned SEG41COM0              :1;
        unsigned SEG42COM0              :1;
        unsigned SEG43COM0              :1;
        unsigned SEG44COM0              :1;
        unsigned SEG45COM0              :1;
        unsigned SEG46COM0              :1;
        unsigned SEG47COM0              :1;
    };
    struct {
        unsigned S40C15                 :1;
    };
} LCDDATA5bits_t;
extern volatile LCDDATA5bits_t LCDDATA5bits __at(0xF65);
// bitfield macros
#define _LCDDATA5_LCDDATA5_POSN                             0x0
#define _LCDDATA5_LCDDATA5_POSITION                         0x0
#define _LCDDATA5_LCDDATA5_SIZE                             0x8
#define _LCDDATA5_LCDDATA5_LENGTH                           0x8
#define _LCDDATA5_LCDDATA5_MASK                             0xFF
#define _LCDDATA5_S40C0_POSN                                0x0
#define _LCDDATA5_S40C0_POSITION                            0x0
#define _LCDDATA5_S40C0_SIZE                                0x1
#define _LCDDATA5_S40C0_LENGTH                              0x1
#define _LCDDATA5_S40C0_MASK                                0x1
#define _LCDDATA5_S41C0_POSN                                0x1
#define _LCDDATA5_S41C0_POSITION                            0x1
#define _LCDDATA5_S41C0_SIZE                                0x1
#define _LCDDATA5_S41C0_LENGTH                              0x1
#define _LCDDATA5_S41C0_MASK                                0x2
#define _LCDDATA5_S42C0_POSN                                0x2
#define _LCDDATA5_S42C0_POSITION                            0x2
#define _LCDDATA5_S42C0_SIZE                                0x1
#define _LCDDATA5_S42C0_LENGTH                              0x1
#define _LCDDATA5_S42C0_MASK                                0x4
#define _LCDDATA5_S43C0_POSN                                0x3
#define _LCDDATA5_S43C0_POSITION                            0x3
#define _LCDDATA5_S43C0_SIZE                                0x1
#define _LCDDATA5_S43C0_LENGTH                              0x1
#define _LCDDATA5_S43C0_MASK                                0x8
#define _LCDDATA5_S44C0_POSN                                0x4
#define _LCDDATA5_S44C0_POSITION                            0x4
#define _LCDDATA5_S44C0_SIZE                                0x1
#define _LCDDATA5_S44C0_LENGTH                              0x1
#define _LCDDATA5_S44C0_MASK                                0x10
#define _LCDDATA5_S45C0_POSN                                0x5
#define _LCDDATA5_S45C0_POSITION                            0x5
#define _LCDDATA5_S45C0_SIZE                                0x1
#define _LCDDATA5_S45C0_LENGTH                              0x1
#define _LCDDATA5_S45C0_MASK                                0x20
#define _LCDDATA5_S46C0_POSN                                0x6
#define _LCDDATA5_S46C0_POSITION                            0x6
#define _LCDDATA5_S46C0_SIZE                                0x1
#define _LCDDATA5_S46C0_LENGTH                              0x1
#define _LCDDATA5_S46C0_MASK                                0x40
#define _LCDDATA5_S47C0_POSN                                0x7
#define _LCDDATA5_S47C0_POSITION                            0x7
#define _LCDDATA5_S47C0_SIZE                                0x1
#define _LCDDATA5_S47C0_LENGTH                              0x1
#define _LCDDATA5_S47C0_MASK                                0x80
#define _LCDDATA5_SEG40COM0_POSN                            0x0
#define _LCDDATA5_SEG40COM0_POSITION                        0x0
#define _LCDDATA5_SEG40COM0_SIZE                            0x1
#define _LCDDATA5_SEG40COM0_LENGTH                          0x1
#define _LCDDATA5_SEG40COM0_MASK                            0x1
#define _LCDDATA5_SEG41COM0_POSN                            0x1
#define _LCDDATA5_SEG41COM0_POSITION                        0x1
#define _LCDDATA5_SEG41COM0_SIZE                            0x1
#define _LCDDATA5_SEG41COM0_LENGTH                          0x1
#define _LCDDATA5_SEG41COM0_MASK                            0x2
#define _LCDDATA5_SEG42COM0_POSN                            0x2
#define _LCDDATA5_SEG42COM0_POSITION                        0x2
#define _LCDDATA5_SEG42COM0_SIZE                            0x1
#define _LCDDATA5_SEG42COM0_LENGTH                          0x1
#define _LCDDATA5_SEG42COM0_MASK                            0x4
#define _LCDDATA5_SEG43COM0_POSN                            0x3
#define _LCDDATA5_SEG43COM0_POSITION                        0x3
#define _LCDDATA5_SEG43COM0_SIZE                            0x1
#define _LCDDATA5_SEG43COM0_LENGTH                          0x1
#define _LCDDATA5_SEG43COM0_MASK                            0x8
#define _LCDDATA5_SEG44COM0_POSN                            0x4
#define _LCDDATA5_SEG44COM0_POSITION                        0x4
#define _LCDDATA5_SEG44COM0_SIZE                            0x1
#define _LCDDATA5_SEG44COM0_LENGTH                          0x1
#define _LCDDATA5_SEG44COM0_MASK                            0x10
#define _LCDDATA5_SEG45COM0_POSN                            0x5
#define _LCDDATA5_SEG45COM0_POSITION                        0x5
#define _LCDDATA5_SEG45COM0_SIZE                            0x1
#define _LCDDATA5_SEG45COM0_LENGTH                          0x1
#define _LCDDATA5_SEG45COM0_MASK                            0x20
#define _LCDDATA5_SEG46COM0_POSN                            0x6
#define _LCDDATA5_SEG46COM0_POSITION                        0x6
#define _LCDDATA5_SEG46COM0_SIZE                            0x1
#define _LCDDATA5_SEG46COM0_LENGTH                          0x1
#define _LCDDATA5_SEG46COM0_MASK                            0x40
#define _LCDDATA5_SEG47COM0_POSN                            0x7
#define _LCDDATA5_SEG47COM0_POSITION                        0x7
#define _LCDDATA5_SEG47COM0_SIZE                            0x1
#define _LCDDATA5_SEG47COM0_LENGTH                          0x1
#define _LCDDATA5_SEG47COM0_MASK                            0x80
#define _LCDDATA5_S40C15_POSN                               0x0
#define _LCDDATA5_S40C15_POSITION                           0x0
#define _LCDDATA5_S40C15_SIZE                               0x1
#define _LCDDATA5_S40C15_LENGTH                             0x1
#define _LCDDATA5_S40C15_MASK                               0x1

